{"config": [{"config": {"name": "Normalization", "arguments": {}, "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>}\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"name": "conv1", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "elu", "nb_row": 5, "nb_col": 5, "nb_filter": 24, "subsample": [2, 2], "bias": true, "init": "he_normal", "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "spatialdropout2d_1", "p": 0.2, "trainable": true}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv2", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "elu", "nb_row": 5, "nb_col": 5, "nb_filter": 36, "subsample": [2, 2], "bias": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "spatialdropout2d_2", "p": 0.2, "trainable": true}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv3", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "elu", "nb_row": 5, "nb_col": 5, "nb_filter": 48, "subsample": [2, 2], "bias": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "spatialdropout2d_3", "p": 0.2, "trainable": true}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv4", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "elu", "nb_row": 3, "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "spatialdropout2d_4", "p": 0.2, "trainable": true}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv5", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "elu", "nb_row": 3, "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "spatialdropout2d_5", "p": 0.2, "trainable": true}, "class_name": "SpatialDropout2D"}, {"config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense1", "activity_regularizer": null, "output_dim": 100, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "elu", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 1152, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense2", "activity_regularizer": null, "output_dim": 50, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "elu", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense3", "activity_regularizer": null, "output_dim": 10, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "elu", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 50, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "activity_regularizer": null, "output_dim": 1, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 10, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}