{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "name": "Normalization", "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fae/Users/kanocarra/Projects/Udacity Self-Driving Car/Project 3 - Behavioural Cloning/car-magic/model.py\u00da\b<lambda>|\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "W_constraint": null, "name": "conv1", "nb_filter": 24, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "init": "he_normal"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "W_constraint": null, "name": "conv2", "nb_filter": 36, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_2"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "W_constraint": null, "name": "conv3", "nb_filter": 48, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_3"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_row": 3, "W_constraint": null, "name": "conv4", "nb_filter": 64, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_4"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_row": 3, "W_constraint": null, "name": "conv5", "nb_filter": 64, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}}, {"class_name": "Dense", "config": {"input_dim": 1152, "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 100, "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"input_dim": 100, "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 50, "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"input_dim": 50, "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 10, "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense3"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"input_dim": 10, "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 1, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense_1"}}], "keras_version": "1.2.0"}